Revit 2026 API

# PanelScheduleTemplateGetSectionData Method

---

Gets the writable section data object.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TableSectionData GetSectionData(
	SectionType sectionType
)
```
```vb
Public Function GetSectionData (
	sectionType As SectionType
) As TableSectionData
```
```cpp
public:
TableSectionData^ GetSectionData(
	SectionType sectionType
)
```
```fsharp
member GetSectionData :
        sectionType : SectionType -> TableSectionData
```

#### Parameters

sectionType SectionType

#### Return Value

TableSectionData The table section data object.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Access to this information requires an open transaction.

#### Reference

PanelScheduleTemplate Class

Autodesk.Revit.DB.Electrical Namespace